{
  "id": "raghuveera-gadyam-complete-core",
  "title": "Sri Raghuveera Gadyam (Mahavira Vaibhavam) - Core Text",
  "author": "Vedanta Desika",
  "introduction": "This is a comprehensive compilation of the rhythmic prose (Gadyam) of the hymn, excluding the introductory salutations (Taniyans). It is structured as a single continuous chapter, with each line representing a major phrase or epithet that summarizes an event from the Ramayana.",
  "chapters": [
    {
      "chapter_number": 1,
      "name": "Complete Raghuveera Gadyam (Continuous Narrative)",
      "summary": "The full narrative flow of the Gadyam, beginning with the salutation 'Jaya Jaya Mahavira' and progressing through all seven Kāṇḍas of the Ramayana.",
      "verses_count": 30,
      "verses": [
        {
          "id": "rg-1-1",
          "verse_number": 1,
          "original": "जय जय महावीरा! महाधीराधौरेय! जय जय!",
          "transliteration": "Jaya jaya mahāvīra! mahādhīra dhaurēya! jaya jaya!",
          "translations": {
            "english": "Victory, Victory to the Great Hero! The foremost among the immensely courageous! Victory! Victory!"
          }
        },
        {
          "id": "rg-1-2",
          "verse_number": 2,
          "original": "देवासुर समर समय समुदित निखिल निर्जर निर्द्धारित निरवधिक माहात्म्य! दशवदन दमित दैवत् परिषदभ्यर्त्थित दाशरथि भाव!",
          "transliteration": "dēvāsura samara samaya samudita nikhila nirjara nirdhārita niravadhika māhātmya! daśavadana damita daivata pariṣadabhyarthita dāśarathi bhāva!",
          "translations": {
            "english": "Whose boundless glory was acknowledged by the gods during the Deva-Asura war! Who took the form of Dasharatha's son at the request of the gods suppressed by Ravana! (Bālakāṇḍam)"
          }
        },
        {
          "id": "rg-1-3",
          "verse_number": 3,
          "original": "दिनकर कुल कमल दिवाकर!  दिविषदधिपति रण सहचरण चतुर दशरथ चरम ऋण विमोचन!",
          "transliteration": "dinakara kula kamala divākara! diviṣadadhipati raṇa sahacaraṇa catura daśaratha carama r̥ṇa vimōcana!",
          "translations": {
            "english": "The Sun for the lotus garden of the Solar Dynasty! Who shrewdly helped Indra in battle, thereby repaying the last debt of Dasaratha! (Bālakāṇḍam)"
          }
        },
        {
          "id": "rg-1-4",
          "verse_number": 4,
          "original": "कौमार केलि गोपा यित कौशिकान्तर!  रणद्वार धूर्य भव्य दिव्यास्त्र बृन्द वन्दित!",
          "transliteration": "kaumāra kēli gōpāyita kauśikāntara! raṇadvāra dhūrya bhavya divyāstra br̥nda vandita!",
          "translations": {
            "english": "Who protected Vishwamitra's sacrifice as a childhood sport! Who is saluted by the mighty assembly of divine missiles ready for battle! (Bālakāṇḍam)"
          }
        },
        {
          "id": "rg-1-5",
          "verse_number": 5,
          "original": "परशुधर मुनिवर कर धृत दुरव नमित निज धनुराकर्षण प्रकाशित पारमेष्ठ्य! जनकदुहितृ कुचतट विहरण समुचित करतल!",
          "transliteration": "parśudhara munivara kara dhr̥ta durava namita nija dhanurākarṣaṇa prakāśita pāramēṣṭhya! janakāduhitr̥ kucataṭa viharaṇa samucita karatala!",
          "translations": {
            "english": "Who demonstrated His Supreme nature by effortlessly stringing His own bow held by Parasurama! Whose hand was perfectly suited to rest on Sita’s waist during their journeys! (Bālakāṇḍam)"
          }
        },
        {
          "id": "rg-1-6",
          "verse_number": 6,
          "original": "अनृत भय मुषित हृदय पितृ वचन पाळन प्रतिज्ञावज्ञात यौवराज्य! निषादराज सौहृद सूचित सौशील्य सागर!",
          "transliteration": "anr̥ta bhaya muṣita hr̥daya pitru vacana pāḷana pratijñāvajñāta yauvarājya! niṣāda rāja sauhr̥da sūcita sauśīlya sāgara!",
          "translations": {
            "english": "Who ignored the Crown-Prince position to honor the promise of His father, whose heart was overwhelmed by the fear of telling a lie! Who is the ocean of good nature, revealed by His friendship with the hunter-king Guha! (Ayōdhyākāṇḍam)"
          }
        },
        {
          "id": "rg-1-7",
          "verse_number": 7,
          "original": "प्रणत भरत मुकुट तट सुघटित पादुकाग्र्याभिषेक निर्वर्त्तित सर्वलोक योगक्षेम!",
          "transliteration": "praṇata bharata mukuṭataṭa sughaṭita pādukāgryābhiṣēka nirvarttita sarvalōka yōgakṣēma!",
          "translations": {
            "english": "Who secured the welfare of all people by having the sacred slippers crowned upon the head of the devoted Bharata! (Ayōdhyākāṇḍam)"
          }
        },
        {
          "id": "rg-1-8",
          "verse_number": 8,
          "original": "पिषित रुची विहित दुरित फल मदन तनय बलि भुगनुगति शरभस शयन तृण शकल परिपतन भय चकित सकल सुर मुनिवर बहुमत महास्त्र सामर्थ्य!",
          "transliteration": "piśita rucī vihita durita phala madana tanaya bali bhuganugati śarābhasa śayana tr̥ṇa śakala paripathana bhaya cakita sakala sura munivara bahumata mahāstra sāmarthya!",
          "translations": {
            "english": "Whose great arrow power was approved by all gods and sages, shown when a blade of grass thrown from His bed scared the son of Indra (Jayanta) who was interested in eating flesh! (Āraṇyakāṇḍam)"
          }
        },
        {
          "id": "rg-1-9",
          "verse_number": 9,
          "original": "विराध विद्रावण विश्राणन विशारद! खरतर खर तरु खण्डन चण्ड पवन!",
          "transliteration": "virādha vidrāvaṇa viśrāṇana viśārada! kharatara khara taru khaṇḍana caṇḍa pavana!",
          "translations": {
            "english": "Who was skilled in the swift banishment and destruction of Viradha! The fierce wind that broke the tree of the terrible Khara! (Āraṇyakāṇḍam)"
          }
        },
        {
          "id": "rg-1-10",
          "verse_number": 10,
          "original": "कबन्ध भुजदण्ड खण्डन चण्डिम! शबरी मोक्ष साधन! हनूमत् समागमानन्दित!",
          "transliteration": "kabandha bhujadaṇḍa khaṇḍana caṇḍima! śabarī mōkṣa sādhana! hanūmat samāgamānandita!",
          "translations": {
            "english": "Whose ferocity crushed the mighty arms of Kabandha! Who was the means for Shabari's liberation! Who rejoiced at the meeting with Hanuman! (Āraṇyakāṇḍam/Kiṣkindhākāṇḍam)"
          }
        },
        {
          "id": "rg-1-11",
          "verse_number": 11,
          "original": "दिवाकर तनय नवराज्य प्रतिष्ठापन! विलुळित बहुफल मखकलम रजनिचर मृग मृगयारम्भ संभृत चीरभृदनुरोध!",
          "transliteration": "divākara tanaya navarājya pratiṣṭhāpana! viluḷita bahuphala makhakalama rajanicara mr̥ga mr̥gayārambha saṁbhr̥ta cīrabhŕdanurōdha!",
          "translations": {
            "english": "Who firmly established the new kingship of Sugriva, the son of the Sun-God! Who was requested by the ascetics to hunt down the deer-like demons that spoiled their sacrifices! (Kiṣkindhākāṇḍam)"
          }
        },
        {
          "id": "rg-1-12",
          "verse_number": 12,
          "original": "अपार पारावार परिघा परिवृत परपुर परिसृत दव दहन जवन पवन भव कपिवर परिष्वङ्ग भावित सर्वस्व दान!",
          "transliteration": "apāra pārāvāra parighā parivr̥ta parapura parisr̥ta dava dahana javana pavanabhava kapivara pariṣvaṅga bhāvita sarvasva dāna!",
          "translations": {
            "english": "Who, with an embrace, conferred all wealth and blessings upon the monkey-chief (Hanuman), the son of the Wind-God, whose speed was like wildfire as he traversed the boundless ocean, the moat surrounding the enemy's city! (Sundarakāṇḍam)"
          }
        },
        {
          "id": "rg-1-13",
          "verse_number": 13,
          "original": "अहित सहोदर रक्षः परिग्रह विसंवादि विविध सचिव विप्रलम्भ समय संरम्भ समुज्जृम्भित सर्वेश्वर भाव! सकृत् प्रपन्न जन संरक्षण दीक्षित वीर!",
          "transliteration": "ahita sahōdara rakṣaḥ parigraha visaṁvādi vividha saciva vipralambha samaya saṁrambha samujjŕmbhita sarvēśvara bhāva! sakr̥t prapanna jana saṁrakṣaṇa dīkṣita vīra!",
          "translations": {
            "english": "Whose Supreme Lordship manifested in the passionate moment of accepting Ravana's inimical brother (Vibhishana), despite the conflicting counsel of His ministers! The Hero dedicated to protecting those who seek refuge in Him even once! (Yuddhakāṇḍam)"
          }
        },
        {
          "id": "rg-1-14",
          "verse_number": 14,
          "original": "त्र्यम्बक समधिक घोरास्त्राडम्बर! सारथि हृत रथ सत्राप शात्रव सत्यापित प्रताप!",
          "transliteration": "tryambaka samadhika ghōrāstrāḍambara! sārathi hr̥ta ratha satrāpa śātrava satyāpita pratāpa!",
          "translations": {
            "english": "Whose display of terrifying weapons surpassed even Shiva's! Whose prowess was proven to the enemy (Ravana) when his charioteer removed the chariot in shame! (Yuddhakāṇḍam)"
          }
        },
        {
          "id": "rg-1-15",
          "verse_number": 15,
          "original": "शित शर कृत लवण दशमुख मुख दशक निपातन पुनरुदय दर गळित जनित दर तरल हरिहय नयन नलिन वन रुचि खचित खतल निपतित सुरतरु कुसुम वितति सुरभित रथ पथ!",
          "transliteration": "śita śara kr̥ta lavaṇa daśamukha mukha daśaka nipātana punarudaya dara gaḷita janita dara taraḷa harihaya nayana naḷinavana ruci khacita khatala nipatita surataru kusuma vitati surabhita ratha patha!",
          "translations": {
            "english": "Whose path was made fragrant by the flowers of celestial trees falling from the sky, whose beauty reflected in the trembling, lotus-like eyes of Indra, who was frightened by the falling and rising of the ten heads of Ravana, which were severed by sharp arrows! (Yuddhakāṇḍam)"
          }
        },
        {
          "id": "rg-1-16",
          "verse_number": 16,
          "original": "अखिल जगदधिक भुज बल दश लपन दशक लवन जनित कदन परवश रजनिचर युवति विलपन वचन समाविषय निगम शिखर निकर मुखर मुनिवर परिपणिता!",
          "transliteration": "akhila jagadadhika bhuja bala daśa lapana daśaka lavaṇa janita kadana paravaśa rajanicara yuvati vilapana vacana samāviṣaya nigama śikhara nikara mukhara munivara paripaṇitā!",
          "translations": {
            "english": "Whose greatness is praised by the Vedas and the sages, coinciding with the lamentations of the demon women distressed by the battle, which was caused by the severing of the heads of the ten-mouthed one whose arm-strength surpassed all others! (Yuddhakāṇḍam)"
          }
        },
        {
          "id": "rg-1-17",
          "verse_number": 17,
          "original": "निष्कम्प पदवी प्रतिष्ठापित विभीषणैश्वर्य! निष्पन्न कृत्य! ख पुष्पित रिपु पक्ष!",
          "transliteration": "niṣkampa padavī pratiṣṭhāpita vibhīṣaṇaiśvarya! niṣpanna kr̥tya! kha puṣpita ripu pakṣa!",
          "translations": {
            "english": "Who established Vibhishana's kingship with unshakeable stability! Whose mission was accomplished! Whose enemies were reduced to mere sky-flowers (non-existent)! (Yuddhakāṇḍam)"
          }
        },
        {
          "id": "rg-1-18",
          "verse_number": 18,
          "original": "पितामह मुख सुर पति नुत मुदित! अमृतमति विधि विदित कथित निज विभव जलधि पृषत लव!",
          "transliteration": "pitāmaha mukha sura pati nuta mudita! amr̥tamati vidhi vidita kathita nija vibhava jaladhi pr̥ṣata lava!",
          "translations": {
            "english": "Who rejoiced at the praise offered by the gods, led by Brahma! Whose glory is just a drop in the ocean, as told by the eternally wise Brahma! (Yuddhakāṇḍam)"
          }
        },
        {
          "id": "rg-1-19",
          "verse_number": 19,
          "original": "स्वसमय विघटित सुघटित सहृदय सहधर्मचारिणीक!  सकल विबुध परिषद् विहित प्रीति!",
          "transliteration": "svasamaya vighaṭita sughaṭita sahr̥daya sahadharmacāriṇīka! sakala vibudha pariṣad vihita prīti!",
          "translations": {
            "english": "Who happily reunited with His true-hearted consort (Sita) after the ordeal was over! Who delighted the entire assembly of the gods! (Yuddhakāṇḍam)"
          }
        },
        {
          "id": "rg-1-20",
          "verse_number": 20,
          "original": "पितृवध कुपित परशुधर मुनि विहित नृप हनन कदन पूर्व काल प्रभाव शत गुण प्रतिष्ठापित धार्मिक राज वंश!",
          "transliteration": "pitr̥vadha kupita paraśudhara muni vihita nr̥pa hanana kadana pūrva kāla prabhāva śata guṇa pratiṣṭhāpita dhārmika rāja vaṁśa!",
          "translations": {
            "english": "Who re-established the righteous royal lineage a hundredfold, which had been previously threatened by the mass killing of kings by Parasurama, who was angered by his father's death! (Uttarakāṇḍam)"
          }
        },
        {
          "id": "rg-1-21",
          "verse_number": 21,
          "original": "कुश लव परिगृहीत कुल गाथा विशेष निशमन निर्वृत!  सर्व जन सम्मानित!",
          "transliteration": "kuśa lava parigr̥hīta kula gāthā viśēṣa niśamana nirvr̥ta! sarva jana sammānita!",
          "translations": {
            "english": "Who was satisfied upon hearing the unique lineage story sung by Kusha and Lava! Who was honored by all people! (Uttarakāṇḍam)"
          }
        },
        {
          "id": "rg-1-22",
          "verse_number": 22,
          "original": "पुनर् उपस्थापिता विमानावर विश्राणन प्रीत वैश्रवण विश्लावित यशः प्रपञ्च! त्रेता युग प्रवर्तित कार्तयुग वृत्तान्त!",
          "transliteration": "punar upasthāpitā vimānāvara viśrāṇana prīta vaiśravaṇa viśrāvitā yaśaḥ prapañca! trētā yuga pravartita kārtayuga vr̥ttānta!",
          "translations": {
            "english": "Who pleased Kubera by returning the Pushpaka Vimana, spreading His fame everywhere! Who established the conduct of the golden Krita Yuga in the Tretā Yuga! (Uttarakāṇḍam)"
          }
        },
        {
          "id": "rg-1-23",
          "verse_number": 23,
          "original": "अविकळ बहु सुवर्ण हय मख सहस्र निर्वहण निर्वर्त्तित निज वर्णाश्रम धर्म!  कैवल्य सुख प्रस्थान!",
          "transliteration": "avikaḷa bahu suvarṇa haya makha sahasra nirvahaṇa nirvarttita nija varṇāśrama dharma! kaivalya sukha prasthāna!",
          "translations": {
            "english": "Who performed numerous, flawless Ashwamedha (Horse) sacrifices, thereby perfectly establishing the duties of the Varṇa and Āśrama! Who departed towards the bliss of liberation! (Uttarakāṇḍam)"
          }
        },
        {
          "id": "rg-1-24",
          "verse_number": 24,
          "original": "सकल विबुध सैलूथ्य सदालोक!  अक्षुण्ण विभव!  नित्य निर्दोष!",
          "transliteration": "sakala vibudha sailūthya sadālōka! akṣuṇṇa vibhava! nitya nirdōṣa!",
          "translations": {
            "english": "Who is the eternal sight of the celestial dancers and actors! Whose glory is indestructible! Who is eternally flawless!"
          }
        },
        {
          "id": "rg-1-25",
          "verse_number": 25,
          "original": "एवं विरचित राघव विभवं वेदान्तदेशिकं स्तुवन्नित्यं भूयात् त्वं रघुपते! मयि मङ्गलाशंसा!",
          "transliteration": "ēvaṁ viracita rāghava vibhavaṁ vēdāntadēśikaṁ stuvannityaṁ bhūyāt tvaṁ raghupatē! mayi maṅgalāśaṁsā!",
          "translations": {
            "english": "O Lord of the Raghus! May the one who daily praises your glory in this manner, as composed by Vedanta Desika, always have your auspicious regard! (Concluding Line)"
          }
        }
      ]
    }
  ]
}
